Repository: ClinicoPath/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/user-manual.po
Languages: de

source: User guide
de: Benutzerhandbuch

source: Welcome to the jamovi user-guide. This contains everything you need to know about getting up and running for jamovi. Note that there are also video tutorials available from |datalab|, and the `learning statistics with jamovi <https://www.learnstatswithjamovi.com/>`__ textbook for those who prefer those formats.
de: Willkommen zum jamovi-Benutzerhandbuch. Es enthält alles, was Sie über die Installation von jamovi und die ersten Schritte im Programm wissen müssen. Zusätzlich zu dieser Einführung können Sie auch die Video-Tutorials von |datalab| und das Lehrbuch `Learning statistics with jamovi <https://www.learnstatswithjamovi.com/>`__ nutzen, wenn Sie andere Formate bevorzugen.

source: jamovi is available for Windows Vista (64-bit) and above. Installation on windows is quite straight-forward, and should be familiar to anyone who has installed software on Windows before. Download the latest version from the `download page <https://www.jamovi.org/download.html>`__, and double-click the icon.
de: jamovi ist für Windows Vista (64-Bit) und neuere Windows-Versionen verfügbar. Die Installation unter Windows ist recht einfach: Laden Sie die gewünschte Version (.exe) von der `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf das Symbol der heruntergeladenen Datei.

source: At some institutions (particularly universities), the “normal” approach to installing software is blocked by IT security policies. In this case, you can download our .zip version. To use this, simply download, unzip to a location on the computer, and naviagate to the bin folder. Double-clicking jamovi.exe will begin jamovi. It’s possible that additional security restrictions prevent jamovi from working in this way, in which case it would be worth raising the issue with your IT staff.
de: In einigen Institutionen (insbesondere Universitäten) wird der „normale“ Ansatz zur Installation von Software (.exe) durch IT-Sicherheitsrichtlinien blockiert. In diesem Fall können Sie die ZIP-Version herunterladen. Um dies zu verwenden, laden Sie es einfach herunter, entpacken Sie es an einen Speicherort auf dem Computer und navigieren Sie zum Ordner bin. Durch Doppelklicken auf jamovi.exe wird jamovi gestartet. Es ist möglich, dass zusätzliche Sicherheitsbeschränkungen verhindern, dass Jamovi auf diese Weise funktioniert. In diesem Fall müssen Sie das Problem bei Ihren IT-Mitarbeitern ansprechen und gemeinsam nach einer Lösung suchen.

source: jamovi is available for macOS 10.9+ (Mavericks and newer). To install it, download the .dmg file from our `download page <https://www.jamovi.org/download.html>`__, and double-click the downloaded file. This will present you with a “file view”, and you can install jamovi by “dragging-and-dropping” the jamovi application to the Applications folder (in the usual way). After this, jamovi will appear in your applications, and can be started like any other installed application.
de: jamovi ist für macOS 10.9+ (Mavericks und neuer) verfügbar. Laden Sie zur Installation die .dmg-Datei von unserer `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf die heruntergeladene Datei. Dadurch wird eine „Dateiansicht“ angezeigt, und Sie können jamovi installieren, indem Sie die jamovi-Anwendung (wie üblich) in den Anwendungsordner ziehen und dort ablegen. Danach wird jamovi in Ihren Anwendungen angezeigt und kann wie jede andere installierte Anwendung gestartet werden.

source: jamovi for macOS has an auto-update mechanism, and can alert you to when new versions are available. You can update your version of jamovi from the app menu (the three dots at the top right of the window).
de: jamovi für macOS verfügt über einen automatischen Aktualisierungsmechanismus und kann Sie benachrichtigen, wenn neue Versionen verfügbar sind. Sie können Ihre jamovi-Version dann über das App-Menü aktualisieren (die drei Punkte oben rechts im Fenster).

source: Linux and Chromebooks
de: Linux und Chromebooks

source: jamovi is currently available for Linux, (for all ‘flatpak participating linux distributions’ – which is most of them), and Chromebooks, from flathub.
de: jamovi ist derzeit für Linux (für alle Linux-Distributionen, die Flatpak-Installationen erlauben - das ist die überwiegende Mehrzahl) und Chromebooks via flathub.org erhältlich.

source: **Note**: Some Chromebooks experience a blank screen issue when starting up jamovi. If you encounter this, there are instructions on how to fix this a little :ref:`further down<blank-screen-on-chromebooks>`.
de: **Hinweis**: Bei einigen Chromebooks startet jamovi mit einem leeren Bildschirm. Wenn Sie auf dieses Problem stoßen, finden Sie Anweisungen, wie Sie dies beheben können :ref:`weiter unten<blank-screen-on-chromebooks>`.

source: If you’re new to flatpak/flathub, you’ll need to follow the setup guide on `our flathub page <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
de: Wenn Sie wenig vertraut mit Flatpaks sind, folgen Sie bitte der Installationsanleitung auf `unserer Flathub-Seite <https://flathub.org/apps/details/org.jamovi.jamovi>`__.

source: If you’re an old hand at flatpak, you can install jamovi with the command::
de: Wenn Sie mit flatpak vertraut sind, können Sie jamovi mit dem folgenden Befehl installieren::

source: and later, you can update your version of jamovi with::
de: und es später mit dem folgenden Befehl aktualisieren::

source: Text not appearing in plots under linux
de: Merkwürdige Sonderzeichen in den Abbildungen unter Linux

source: On some linux machines, the flatpak font cache is not up-to-date, resulting in plots in jamovi not displaying text correctly. To remedy this, you can run the following command at the terminal::
de: Auf einigen Linux-Computern wird der Schriftarten-Cache unter Flatpak nicht wie vorgesehen aktualisiert, was dazu führt, dass in Abbildungen in jamovi der Text der Beschriftungen nicht korrekt angezeigt wird. Um dies zu beheben, können Sie den folgenden Befehl im Terminal ausführen::

source: This appears to be an issue with flatpaks, and we’re working with the flatpak community to get to the bottom of it.
de: Dies scheint ein Problem mit Flatpaks zu sein, und wir arbeiten mit der Flatpak-Community zusammen, um eine dauerhafte Lösung für das Problem zu finden.

source: Blank screen at startup on Chromebooks
de: Leerer Bildschirm beim Start von jamovi auf Chromebooks

source: Some Chromebooks experience a blank screen when starting up jamovi. The cause of this issue is not completely clear at this time, however it can be fixed by disabling “Crostini GPU support”.
de: Auf einigen Chromebooks wird beim Starten von jamovi ein leerer Bildschirm angezeigt. Die Ursache dieses Problems ist derzeit noch nicht vollständig geklärt. Sie lässt sich jedoch durch Deaktivieren der „Crostini-GPU-Unterstützung“ beheben.

source: Enter ``chrome://flags/`` into the ChromeOS address bar. This will bring up “Experiments”. Search for ``Crostini GPU Support`` and set it to disabled. After restarting your Chromebook the issue will be fixed. (Special thanks to `@mulderc <https://github.com/mulderc>`__)
de: Geben Sie ``chrome://flags/`` in der ChromeOS-Adressleiste ein. Dies öffnet "Experimentelle Einstellungen". Suchen Sie nach ``Crostini GPU Support`` und deaktivieren Sie die Einstellung. Nach dem Neustart Ihres Chromebooks ist das Problem behoben. (Danke an `@mulderc <https://github.com/mulderc>`__ für den Hinweis)

source: Getting Started
de: Erste Schritte

source: When first starting jamovi, you will be presented with a user interface which looks something like this.
de: Beim ersten Start von jamovi wird eine Benutzeroberfläche angezeigt, die ungefähr so aussieht.

source: To the left is the spreadsheet view, and to the right is where the results of statistical tests appear. Down the middle is a bar separating these two regions, and this can be dragged to the left or the right to change their sizes.
de: Links befindet sich die Tabelle mit Ihren Rohdaten (wie in einer Tabellenkalkulation), rechts werden die Ergebnisse der statistischen Tests angezeigt. In der Mitte befindet sich ein Balken, der diese beiden Bereiche trennt. Dieser Balken kann nach links oder rechts gezogen werden, um die Größe der beiden Bereiche (Tabelle und Ausgabe) zu ändern.

source: It is possible to simply begin typing values into the jamovi spreadsheet as you would any other spreadsheet software. Alternatively, existing data sets in a range of formats (CSV, SPSS, Stata, SAS) can be opened in jamovi. Additionally, there are a number of example data sets available in jamovi. To open a file, select the File tab at the top left hand corner, select ‘Open’ and then ‘Examples’ or ‘This PC’, depending on whether you want to open an example, or a file stored on your computer.
de: Es ist möglich, wie bei jeder anderen Tabellenkalkulation, mit der Eingabe von Werten in die jamovi-Daten-Tabelle zu beginnen. Normalerweise werden Sie aber mit existierenden Datensätzen arbeiten. jamovi erlaubt Ihnen solche Datensätze, die in verschiedenen Formaten (CSV, SPSS, Stata, SAS) vorliegen können, zu öffnen. Darüber hinaus gibt es in jamovi eine Reihe von Beispieldatensätzen. Um eine Datei zu öffnen, benutzen Sie das Menü (☰) in der oberen linken Ecke von jamovi, wählen Sie "Open" und dann "This PC" oder "Data Library", je nachdem, ob Sie eine auf Ihrem Computer gespeicherte Datei oder ein Beispiel öffnen möchten.

source: If jamovi does not open a CSV file correctly, do file an issue (bug report) in our GitHub `issue tracker <https://github.com/jamovi/jamovi/issues>`__. We are keen to make our importer as robust as possible.
de: Wenn jamovi eine Datei nicht korrekt öffnet, melden Sie das Problem bitte über unserem GitHub `Issue Tracker <https://github.com/jamovi/jamovi/issues>`__. Wir möchten unseren Datei-Import so robust wie möglich machen.

source: Analyses
de: Analysen

source: Analyses can be selected from the analyses ribbon or menu along the top. Selecting an analysis will present an ‘options panel’ for that particular analysis, allowing you to assign different variables to different parts of the analysis, and select different options. At the same time, the results for the analysis will appear in the right ‘Results panel’, and will update as you make changes to the options.
de: Analysen können über das Ribbon-Menü mit den Analyse ausgewählt werden. Wenn Sie eine Analyse auswählen, wird ein Optionsfeld für diese Analyse angezeigt, in dem Sie in verschiedenen Eingabefeldern Variablen zuweisen oder Optionen auswählen können. Gleichzeitig werden die Ergebnisse für die Analyse im rechten Teil des jamovi-Fensters angezeigt und aktualisiert, wenn Sie Änderungen an den Optionen vornehmen.

source: When you have the analysis set up correctly, you can dismiss the analysis options by clicking the arrow to the top right of the optional panel. If you wish to return to these options, you can click on the results that were produced. In this way, you can return to any analysis that you (or say, a colleague) created earlier.
de: Wenn Sie das Setzen der Einstellungen für die Analyse beendet haben, können Sie das Eingabefenster mit den Analyseoptionen schließen, indem Sie auf den Pfeil oben rechts im Eingabefenster klicken. Wenn Sie zu diesen Optionen zurückkehren möchten, klicken Sie auf die Ergebnisausgabe. Auf diese Weise können Sie zu jeder Analyse zurückkehren, die Sie (oder eine andere Person) zuvor erstellt haben.

source: If you decide you no longer need a particular analysis, you can remove it with the results context menu. Right-clicking on the analysis results will bring up a menu, and by selecting ‘Analysis’, and then ‘Remove’, the analysis can be removed.
de: Wenn Sie entscheiden, dass Sie eine bestimmte Analyse nicht mehr benötigen, können Sie diese über das Kontextmenü im Analyse-Fenster entfernen. Hierfür klicken Sie mit der rechten Maustaste auf die Analyseergebnisse. Im sich öfnnenden Menü wählen Sie "Analysis" und dann "Remove" um die Analyse zu entfernen.

source: The Spreadsheet
de: Daten-Editor

source: In jamovi, data is represented in a spreadsheet, with each column representing a ‘variable’.
de: In jamovi werden Daten in einer Tabelle dargestellt, wobei jede Spalte eine „Variable“ darstellt und jede Zeile einen Meßpunkt (normalerweise eine Person von der Daten erhoben wurden).

source: Data Variables
de: Daten-Variablen

source: The most commonly used variables in jamovi are ‘Data Variables’, these variables simply contain data either loaded from a data file, or ‘typed in’ by the user. Data variables can be one three data types:
de: Die in jamovi am häufigsten verwendeten Variablen sind "Datenvariablen". Diese Variablen enthalten einfach Daten, die entweder aus einer Datendatei geladen oder vom Benutzer eingegeben wurden. Datenvariablen können zu einem von drei Datentypen gehören:

source: ``Integer``
de: ``Integer`` (Ganzzahl)

source: ``Decimal``
de: ``Decimal`` (Dezimalzahl)

source: and one of four measure types:
de: außerdem existeren vier verschiedene Skalenniveaus:

source: |variable-nominal| ``Nominal``
de: |variable-nominal| ``Nominal`` (Variable mit nominalem Skalenniveau)

source: |variable-ordinal| ``Ordinal``
de: |variable-ordinal| ``Ordinal`` (Variable auf ordinalen Skalenniveau)

source: |variable-continuous| ``Continuous``
de: |variable-continuous| ``Continuous`` (Variable mit kontinuierlichem Skalenniveau)

source: |variable-id| ``ID``
de: |variable-id| ``ID`` (ID-Variable)

source: The measure types are designated by the symbol in the header of the variable’s column. Note that some combinations of data-type and measure-type don’t make sense, and jamovi won’t let you choose these.
de: Das Skalenniveau einer Variablen wird durch ein Symbol in der Kopfzeile der Spalte angezeigt. Beachten Sie, dass einige Kombinationen aus Datentyp und Skalenniveau keinen Sinn ergeben und jamovi nicht zulässt, dass solche Kombinationen ausgewählt werden.

source: ``Nominal`` and ``Ordinal`` are, predictably, for nominal and ordinal variables. ``Continuous`` is for variables with numeric values which are considered to be *Interval* or *Ratio* scales (Equivalent to ``Scale`` in SPSS). The ``ID`` measure type is, unlike the others, unique to jamovi. It’s intended for variables that contain identifiers that you would almost never want to analyse. For example, a persons name, or a participant ID. The advantage of IDs, is that jamovi does not need to maintain a list of levels internally, which can improve performance when interacting with very large data sets.
de: ``Nominal`` and ``Ordinal`` sind für Variablen mit nominalem bzw. ordinalem Skalenniveau. ``Continuous`` kennzeichnet Variablen die numerische Werte enthalten und die ein *Intervall*- oder *Verhältnis*-Skalenniveau aufweisen (ähnlich der Einstellung ``Scale`` in SPSS). Der Kennzahlentyp "ID" ist nur in jamovi verfügbar. Es kennzeichnet Variablen, bei denen es wenig Sinn ergibt, sie zu analysieren, Dabei handelt es sich z.B. um Personennamen oder eine Teilnehmer-ID. Der Vorteil dieses Variablentyps besteht darin, dass jamovi intern keine Liste von Faktorstufen speichern muss, was die Leistung beim Analysieren sehr großen Datenmengen verbessern kann.

source: When starting with a blank spreadsheet and typing values in, the data and measure types will change automatically depending on the data you enter. This is a good way to get a feel for which variable types go with which sorts of data. Similarly, when opening a data file, jamovi will infer the variable type from the data in each column. In both cases, this automatic approach may not be correct, and it may be necessary to manually specify the data and measure type with the variable editor.
de: Wenn Sie mit einer leeren Tabelle beginnen und Werte eingeben, ändern sich die Daten- und Kennzahlentypen automatisch in Abhängigkeit von den von Ihnen eingegebenen Daten. Dies ist ein guter Weg, um ein Gefühl dafür zu bekommen, welche Variablentypen zu welchen Datentypen gehören. In ähnlicher Weise leitet jamovi beim Öffnen einer Datendatei den Variablentyp aus den Daten in jeder Spalte ab. In beiden Fällen kann es sein, dass die automatische Bestimmung nicht korrekt ist. Dann kann es erforderlich sein, den Datentyp und das Skalenniveau manuell mit dem Variableneditor zu ändern.

source: The variable editor can be invoked by selecting ‘Setup’ from the data tab, double-clicking on the column header, or by pressing F3. The variable editor allows you to change the name of the variable, and (for data variables) the data type, the measure type, the order of the levels, and the label displayed for each level. The variable editor can be dismissed by clicking the close arrow, or by pressing F3 again.
de: Der Variableneditor kann durch Klicken auf das "Setup"-Icon unter der Registerkarte "Data", durch Doppelklicken auf die Spaltenüberschrift oder durch Drücken von F3 aufgerufen werden. Mit dem Variableneditor können Sie den Namen der Variablen und (für Daten-Variablen) den Datentyp, das Skalenniveau, die Reihenfolge der Faktorstufen und die für jede Faktorstufe angezeigte Bezeichnung ändern. Der Variableneditor kann durch Klicken auf den Schließpfeil oder durch erneutes Drücken von F3 geschlossen werden.

source: New variables can be inserted or appended to the data set using the ‘add’ button from the data ribbon. The ‘add’ button also allows the addition of *Computed variables*.
de: Neue Variablen können über die Schaltfläche "Add" im Abschnitt "Variables" der Registerkarte "Data" in den Datensatz eingefügt oder an diesen angehängt werden. Die Schaltfläche "Hinzufügen" ermöglicht auch das Hinzufügen von *berechneten Variablen* und *umkodierten Variablen*.

source: Computed Variables
de: Berechnete Variablen

source: Computed Variables are those which take their value by performing a computation on other Variables. Computed Variables can be used for a range of purposes, including log transforms, z-scores, sum-scores, negative scoring and means.
de: Berechnete Variablen erhalten ihren Wert, indem sie mit ihnen Berechnungen für andere Variablen durchgeführt werden. Berechnete Variablen können für verschiedene Zwecke eingesetzt werden. Hierzu gehören Transformationen (z.B. Logarithmierung) sowie die Berechnung von z-, Summen- oder invertierten Scores oder von Mittelwerten.

source: *Computed variable*\ s can be added to the data set, with the ‘add’ button available on the data tab. This will produce a formula box where you can specify the formula. The usual arithmetic operators are available. Some examples of formulas are::
de: *Berechnete Variablen* können mit dem "Add"-Icon im Abschnitt "Variables" der Registerkarte "Data" zu einem Datensatz hinzugefügt werden. Dies öffnet ein Eingabefenster, in dem Sie die Formel in einm Eingabefeld angeben können (oder durch das Klicken auf "f(x)" zusammenstellen). Es stehen die üblichen arithmetischen Operatoren und eine Vielzahl mathematischer Funktionen zur Verfügung. Einige Beispiele für solche Formeln sind::

source: In order, these are the sum of A and B, a log (base 10) transform of ``len``, the mean of ``A`` and ``B``, and the z-score of ``dose`` (twice).
de: In der Reihenfolge sind dies die Summe der Variablen ``A`` und ``B``, eine logarithmische Transformation (mit der Basis 10) der Variable ``len``, der Mittelwert der Variablen ``A`` und ``B``, sowie des z-Scores von ``Dose`` (mittels zweier verschiedener Berechnungsmethoden).

source: There are many more functions available.
de: Darüber hinaus existiert eine Vielzahl weiterer Funktionen.

source: ``V``-functions
de: ``V``-Funktionen

source: A number of functions appear in pairs, one prefixed with a ``V`` and the other not. ``V`` functions perform their calculation on a variable *as a whole*, where as non-``V`` functions perform their calculation row by row. For example, ``MEAN(A, B)`` will produce the mean of ``A`` and ``B`` for each row. Where as ``VMEAN(A)`` gives the mean of *all* the values in ``A``.
de: Eine Reihe von Funktionen existiert "paarweise", wobei eine Funktion jedes Paars ein ``V`` vorangestellt hat (und die andere nicht). ``V``-Funktionen führen ihre Berechnung für eine Variable *als Ganzes* durch (d.h. innerhalb einer Spalte), während Nicht-``V``-Funktionen ihre Berechnung zeilenweise durchführen. Zum Beispiel erzeugt "MEAN(A, B)" den Mittelwert von ``A`` und ``B`` für jede Zeile. "VMEAN(A)" berechnet den Mittelwert *aller* Werte (bzw. Fälle oder Zeilen) innerhalb der Variablen ``A``.

source: Additionally ``V`` functions support a ``group_by`` argument (in 0.9.6 and up). When a ``group_by`` variable is specified, a separate value is calculated for each level of the ``group_by`` variable. In the following example::
de: Zusätzlich unterstützen ``V``-Funktionen ein ``group_by``-Argument. Wenn unter ``group_by`` eine bestimmte Variable angegeben wird, wird für jede Faktorstufe dieser Variablen ein separater Wert berechnet. Im folgenden Beispiel:

source: A separate mean is calculated for each level of ``dose``, and each value in the computed variable will be the mean corresponding to it’s row’s value of ``dose``.
de: wird für jede Stufe von "Dose" ein separater Mittelwert berechnet. Jeder Wert in den Zeilen der berechneten Variablen entspricht dem Mittelwert von "Dose" für alle Messwerte innerhalb dieser Faktorstufe.

source: Recoded Variables
de: Umkodierte Variablen

source: Transformed and recoded variables are also available. See this `blog post <https://blog.jamovi.org/2018/10/23/transforming-variables.html>`__ for details.
de: Es ist ebenfalls möglich, Variablen zu rekodieren. Weitere Informationen finden Sie in diesem `Blog-Beitrag <https://blog.jamovi.org/2018/10/23/transforming-variables.html>`__.

source: Filters
de: Filter-Variablen

source: Filters in jamovi allow you to filter out rows that you don’t want included in your analysis. For example, you might want to only include people’s survey responses if they explicitly consented to having their data used, or you might want to exclude all left-handed people, or perhaps people who score ‘below chance’ in an experimental task. In some cases you just want to exclude extreme scores, for example those that score more than 3 standard deviations from the mean.
de: Filter-Variablen in jamovi erlauben Ihnen Zeilen herausfiltern, die nicht in Analysen einbezogen werden sollen. Auf diese Weise können Sie beispielsweise nur die Umfrageantworten von Personen einbeziehen, die ausdrücklich der Verwendung ihrer Daten zugestimmt haben, oder Sie können alle Linkshänder oder Personen die in einer experimentellen Aufgabe „unter dem Zufall“ liegen ausschließen? Sie können auch Fälle ausschließen, die extreme Werte aufweisen und z.B. mehr als 3 Standardabweichungen vom Mittelwert abweichen.

source: The filters in jamovi are build on top of jamovi’s *computed variable* formula system, which allows the building of arbitrarily complex formulas.
de: Die Filter in jamovi basieren auf dem Formelsystem, mit dem auch *berechnete Variablen* erzeugt werden. Mit diesem System lassen sich beliebig komplexe Formeln erstellen.

source: More details about filters are covered in `this blog post <https://blog.jamovi.org/2018/04/25/jamovi-filters.html>`__
de: Umfassendere Vorstellung von Filter-Variablen in jamovi finden Sie in diesem `Blog-Beitrag <https://blog.jamovi.org/2018/04/25/jamovi-filters.html>`__.

source: Updating data
de: Daten importieren
