Repository: ClinicoPath/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/user-manual.po
Languages: de

source: Once a data set is set up with filters, computed variables, transforms and analyses, sometimes you may want to update the data. This may be for a number of reasons – It might be that you have a new data set, that you want to apply the analyses you performed earlier to it, or you may be conducting an experiment where you’re tesing a number of participants, and you now have an additional participant’s data to analyse. By importing into an existing data set you can re-run your analyses without having to re-perform all of your data cleaning and analysis steps (making your jamovi files behave a bit like scripts).
de: Sobald ein Datensatz mit Filtern, berechneten Variablen, Transformationen und Analysen eingerichtet ist, möchten Sie manchmal die Daten aktualisieren. Dies kann verschiedene Gründe haben: Möglicherweise verfügen Sie über einen umfangreicheren oder bereinigten Datensatz, mit dem Sie die zuvor durchgeführten Analysen erneut anwenden möchten oder Sie führen ein Experiment durch, bei dem Sie eine Reihe von Teilnehmern testen und Sie müssen zu einem späteren Zeitpunkt die Daten eines zusätzlichen Teilnehmers analysieren. Durch den Import und das Hinzufügen zu einem vorhandenen Datensatz können Sie Ihre Analysen erneut ausführen, ohne alle Schritte zur Datenbereinigung und -analyse erneut ausführen zu müssen (sodass sich Ihre jamovi-Dateien ein wenig wie Skripte verhalten).

source: For a video introduction to import and templates in jamovi, see `this blog post <https://blog.jamovi.org/2019/03/27/import.html>`__.
de: Eine Video-Einführung zum Importieren von Daten und zu Analyse-Vorlagen in jamovi finden Sie unter diesem `Blog-Beitrag <https://blog.jamovi.org/2019/03/27/import.html>`__.

source: Single-file Import
de: Importieren von einzelnen Daten-Dateien

source: Import is available from the file menu (☰) at the top left of jamovi. When you import a file into an existing data set, the following operations are performed.
de: Der Import von Dateien ist über das Dateimenü (☰, oben links im jamovi-Fenster) möglich. Wenn Sie eine Datei zu einem vorhandenen Datensatz hinzufügen wollen, müssen Sie die folgenden Schritte durchführen.

source: All the rows of the existing data set are deleted.
de: Löschen Sie alle Zeilen innerhalb des existierenden Datensatzes.

source: All the (original) names of the existing columns are matched to the names of the columns from the new data set.
de: Die Namen der Spalten aus dem neuen Datensatz werden mit den (ursprünglichen) Namen der vorhandenen Spalten abgeglichen.

source: The new values are imported to the existing columns, *keeping* the data and measure types from the existing data set.
de: Die neuen Werte werden in die vorhandenen Spalten importiert, wobei der Datentyp und das Skalenniveau der Variablen des vorhandenen Datensatzes *beibehalten* wird.

source: The new columns which did not match names in the original data set are appended to the right of the data set.
de: Die Spalten, deren Name nicht mit einer Spalte des Originaldatensatzes übereinstimmt, werden rechts (am Ende) des existierenden Datensatzes hinzugefügt.

source: If no new column matches the column names in the existing data set, then those columns are left blank.
de: Wenn keine neue Spalte mit einem Spaltennamen des vorhandenen Datensatzes übereinstimmt, bleiben diese Spalten leer.

source: Following a file import, all the filters, computed variables, transforms and analyses update.
de: Nach einem Dateiimport werden alle berechneten oder umkodierten Variablen, alle Filter sowie alle Analysen aktualisiert.

source: Multi-file Import
de: Import mehrerer Dateien

source: It is also possible to import multiple files at once. This can be useful when you are combining multiple data sets, for example, where each file represents a participant. The process is the same as the single-file import detailed above, except that you select multiple files when performing the import. You can do this by holding down control or shift when selecting data files, or with the ‘multi-select’ button at the top of the import dialog.
de: Es ist auch möglich, mehrere Dateien gleichzeitig zu importieren. Dies kann nützlich sein, wenn Sie beispielsweise mehrere Datensätze (bei denen jede Datei einen Teilnehmer darstellt) kombinieren wollen. Der Vorgang ist der gleiche wie beim oben beschriebenen Import einzelner Dateien, außer dass Sie beim Importieren mehrere Dateien auswählen. Sie können dies tun, indem Sie bei der Auswahl von Daten-Dateien die Strg- oder Umschalt-Taste gedrückt halten oder die Schaltfläche "Mehrfachauswahl" oben im Importdialogfeld verwenden.

source: When importing multiple files like this, they are combined vertically with the rows of the second file appearing below the first, the rows of the third file appearing below the second, and so on. An additional column called ``source`` is created detailing which file each row has come from. This can be useful when you need to ‘split-by’ or ‘group-by’ each participant. This column can be particularly useful to use with the ``group_by`` argument to ``V``-functions described above.
de: Wenn Sie mehrere Dateien wie diese importieren, werden sie vertikal kombiniert, wobei die Zeilen der zweiten Datei unter der ersten, die Zeilen der dritten Datei unter der zweiten usw. eingefügt werden. Eine zusätzliche Spalte mit dem Namen ``source`` wird erstellt, in der angegeben wird, aus welcher Datei jede Zeile stammt. Dies kann nützlich sein, wenn Sie jeden die Daten für verschiedene Teilnehmer "aufteilen" oder "gruppieren" müssen. Diese Spalte kann besonders nützlich sein, um sie mit dem Argument ``group_by`` für die oben beschriebenen ``V``-Funktionen zu verwenden.

source: At present, there is no way to combine files horizontally in jamovi.
de: Zurzeit gibt es in Jamovi noch keine Möglichkeit, Dateien horizontal zu kombinieren (d.h. Variablen hinzuzufügen).

source: Templates
de: Analyse-Vorlagen

source: Templates in jamovi are special data sets that are analagous to script files in more traditional statistical environments. They are a way to specify data types, computations, filters, transforms, and analyses in advance. Once the data becomes available, it can be imported into the template, and the template will update accordingly. The nice thing about jamovi templates is that they are entirely specified with the familiar user interface, and do not require working with a ‘syntax’ or code.
de: Analyse-Vorlagen in jamovi sind ein spezieller Dateityp, der mit Skript-Dateien in traditionelleren Statistik-Programmen vergleichbar ist. Sie sind eine Möglichkeit, Datentypen, Berechnungen, Filter, Transformationen und Analysen im Voraus festzulegen. Sobald die Daten verfügbar sind, können sie in die Vorlage importiert werden, und die Vorlage wird entsprechend aktualisiert. Das Schöne an Analyse-Vorlagen ist, dass sie vollständig mit der bekannten Benutzeroberfläche spezifiziert sind und nicht mit einer „Syntax“ oder einem Code arbeiten müssen.

source: To save a data set as a template, select ‘Export’ from the file menu, and select ‘jamovi template’ from the file type box. When opening a template, you’ll see it contains columns but no rows, and that all the analysis results are blank. To use the template, import a new data set (or data sets) using the file import described above. The data will update, followed by the filters, computed variables, and finally the analysis results.
de: Um eine Analyse-Vorlage zu speichern, wählen Sie im Dateimenü (☰) die Option "Export" und als Dateityp die Option "jamovi template (.omt)". Wenn Sie eine Vorlage öffnen, sehen Sie, dass sie Spalten, aber keine Zeilen enthält und dass alle Analyseergebnisse leer sind. Um die Vorlage zu verwenden, importieren Sie einen neuen Datensatz (oder neue Datensätze) mit Hilfe des oben beschriebenen Dateiimports. Die Daten werden aktualisiert, die Daten werden entsprechend der festgelegten Bedingungen gefiltert, berechnete Variablen erhalten enstsprechend der Berechnungsvorschriften (Formeln) ihren Wert und schließlich werden mit diesen Einstellungen und Variablen die Analyseergebnisse erzeugt.

source: jamovi templates are also a great way to provide analyses to less capable students or colleagues.
de: Analyse-Vorlagen sind außerdem eine großartige Möglichkeit, Studenten oder Kollegen, die weniger Erfahrung mit statistischen Analysen haben, dabei zu helfen, solche Analysen selbst durchzuführen.

source: jamovi produces nice APA formatted tables, and attractive plots. It is often useful to be able to copy and paste these, perhaps into a Word document, or into an email to a colleague. To copy results, right click on the object of interest, and from the menu select exactly what you want to copy. The menu allows you to choose to copy, say only the image, or the entire analysis. Selecting copy, copies the content to the clipboard, and can be pasted into the other program in the usual way.
de: jamovi erzeugt Tabellen und Diagramme die entsprechend den Vorgaben des APA-Stils formatiert sind. Diese lassen sich einfach kopieren und einfügen, beispielsweise in ein Dokument oder in eine E-Mail an einen Kollegen. Um die Ergebnisse zu kopieren, klicken Sie mit der rechten Maustaste auf das gewünschte Ergebnis-Objekt und wählen im Kontext-Menü den Teil der Analyse aus, den Sie kopieren möchten. Das heißt, dass sie über das Kontext-Menü auswählen können, ob Sie nur das Bild, nur die Tabelle oder die gesamte Analyse kopieren möchten. Wenn Sie "Copy" auswählen, wird der Inhalt in die Zwischenablage kopiert und kann wie gewohnt in das andere Programm eingefügt werden.

source: Syntax Mode
de: Syntax-Modus

source: jamovi also provides an “R Syntax Mode”, in this mode, jamovi produces equivalent R code for each analysis. To change to syntax mode, select the Application menu to the top right of jamovi (a button with three dots), and check the “Syntax mode” checkbox there. It is possible to leave syntax mode by clicking this a second time.
de: jamovi bietet auch einen „R-Syntax“-Modus. In diesem Modus erzeugt jamovi R-Code, um die entsprechende Analyse in R durchzuführen. Um in den Syntax-Modus zu wechseln, wählen Sie das Anwendungsmenü oben rechts in jamovi (ein Icon mit drei Punkten) und aktivieren Sie dort das Kontrollkästchen „Syntax mode“. Sie können den Syntax-Modus verlassen, indem Sie ein zweites Mal auf das Kontrollkästchen klicken (und den "Tick" entfernen).

source: In syntax mode, analyses continue to operate as before, but now they produce R syntax, and ‘ascii output’ like an R session. Like all results objects in jamovi, you can right click on these items (including the R syntax) and copy and paste them, for example, into an R session.
de: Im Syntax-Modus funktionieren die Analysen weiterhin wie zuvor, aber jetzt wird R-Syntax erzeugt und es erfolgt eine Ausgabe als ASCII wie in einer R-Sitzung. Wie bei allen Ergebnisobjekten in jamovi können Sie mit der rechten Maustaste auf diese Elemente (einschließlich der R-Syntax) klicken und sie beispielsweise kopieren und in eine R-Sitzung einfügen.

source: At present, the provided R syntax does not include the data import step, and this must be performed manually. There are many resources explaining how to import data into R, and we recommend you take a look at these (Most analyses in jamovi require data as a data frame).
de: Derzeit enthält die bereitgestellte R-Syntax nicht die notwendigen R-Funktionen für den Import der Daten unter R. Dies muss manuell durchgeführt werden. Es gibt viele Ressourcen, die erklären, wie Daten in R importiert werden, und wir empfehlen, dass Sie sich diese ansehen. Die meisten jamovi-Analysen erfordern, dass die Daten als data frame vorliegen.

source: Another R feature that may be of interest is `the Rj module <https://blog.jamovi.org/2018/07/30/rj.html>`__, which allows you to use R code to analyse data directly in jamovi.
de: Eine weitere interessante Möglichkeit ist, mithilfe des `Rj-Moduls <https://blog.jamovi.org/2018/07/30/rj.html>`__, R-Code zu verwenden, um ihre Daten direkt in jamovi mithilfe von R-Funktion zu analysieren.
